
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13113138205)


<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_pages_domain.clov3r-cc
  * cloudflare_pages_domain.www-clov3r-cc
  * cloudflare_zero_trust_access_application.pxmx01-mng
  * cloudflare_zero_trust_access_group.allow_github
  * cloudflare_zero_trust_access_policy.allow_github
* Update
  * cloudflare_zero_trust_tunnel_cloudflared.cloudflared-01


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_pages_domain.clov3r-cc will be created
  + resource "cloudflare_pages_domain" "clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_pages_domain.www-clov3r-cc will be created
  + resource "cloudflare_pages_domain" "www-clov3r-cc" {
      + account_id            = "fff06038a70892193e0fa1e9e270436a"
      + certificate_authority = (known after apply)
      + created_on            = (known after apply)
      + domain_id             = (known after apply)
      + id                    = (known after apply)
      + name                  = "www.clov3r.cc"
      + project_name          = "my-home"
      + status                = (known after apply)
      + validation_data       = (known after apply)
      + verification_data     = (known after apply)
      + zone_tag              = (known after apply)
    }

  # cloudflare_zero_trust_access_application.pxmx01-mng will be created
  + resource "cloudflare_zero_trust_access_application" "pxmx01-mng" {
      + app_launcher_visible         = true
      + aud                          = (known after apply)
      + auto_redirect_to_identity    = false
      + cors_headers                 = (known after apply)
      + created_at                   = (known after apply)
      + destinations                 = (known after apply)
      + domain                       = "pxmx01-mng"
      + enable_binding_cookie        = false
      + footer_links                 = (known after apply)
      + http_only_cookie_attribute   = true
      + id                           = (known after apply)
      + landing_page_design          = (known after apply)
      + name                         = "Access application for pxmx01-mng"
      + path_cookie_attribute        = false
      + policies                     = [
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = (known after apply)
              + include          = (known after apply)
              + precedence       = 1
              + require          = (known after apply)
            },
          + {
              + connection_rules = (known after apply)
              + exclude          = (known after apply)
              + id               = "24688b5e-f084-4bc2-8671-1fa1c380bb24"
              + include          = (known after apply)
              + precedence       = 2
              + require          = (known after apply)
            },
        ]
      + saas_app                     = (known after apply)
      + scim_config                  = (known after apply)
      + session_duration             = "24h"
      + skip_app_launcher_login_page = false
      + target_criteria              = (known after apply)
      + updated_at                   = (known after apply)
      + zone_id                      = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_group.allow_github will be created
  + resource "cloudflare_zero_trust_access_group" "allow_github" {
      + created_at = (known after apply)
      + exclude    = (known after apply)
      + id         = (known after apply)
      + include    = [
          + {},
        ]
      + name       = "Allow GitHub"
      + require    = (known after apply)
      + updated_at = (known after apply)
      + zone_id    = "b52fd73ec52e35fea1807a173e33e93a"
    }

  # cloudflare_zero_trust_access_policy.allow_github will be created
  + resource "cloudflare_zero_trust_access_policy" "allow_github" {
      + account_id                     = "fff06038a70892193e0fa1e9e270436a"
      + app_count                      = (known after apply)
      + approval_groups                = (known after apply)
      + approval_required              = false
      + created_at                     = (known after apply)
      + decision                       = "allow"
      + exclude                        = (known after apply)
      + id                             = (known after apply)
      + include                        = [
          + {
              + group = {
                  + id = (known after apply)
                }
            },
        ]
      + isolation_required             = false
      + name                           = "To SSO with GitHub"
      + purpose_justification_required = false
      + require                        = (known after apply)
      + reusable                       = (known after apply)
      + session_duration               = "24h"
      + updated_at                     = (known after apply)
    }

  # cloudflare_zero_trust_tunnel_cloudflared.cloudflared-01 will be updated in-place
  ~ resource "cloudflare_zero_trust_tunnel_cloudflared" "cloudflared-01" {
      ~ account_tag       = "fff06038a70892193e0fa1e9e270436a" -> (known after apply)
      ~ connections       = [] -> (known after apply)
      + conns_active_at   = (known after apply)
      ~ conns_inactive_at = "2025-02-03T12:05:18Z" -> (known after apply)
      ~ created_at        = "2025-02-03T12:05:18Z" -> (known after apply)
      + deleted_at        = (known after apply)
        id                = "d84b01bf-a3a4-4217-9e70-54984b1e4fdd"
      ~ metadata          = jsonencode({}) -> (known after apply)
      ~ name              = "Terraform tunnel to proxmox-01 container in lucky-proxmox-01" -> "proxmox-01 container in proxmox-01"
      ~ remote_config     = true -> (known after apply)
      ~ status            = "inactive" -> (known after apply)
      ~ tun_type          = "cfd_tunnel" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Resource not found

  with cloudflare_pages_domain.clov3r-cc,
  on my_homepage.tf line 20, in resource "cloudflare_pages_domain" "clov3r-cc":
  20: resource "cloudflare_pages_domain" "clov3r-cc" {

The resource was not found on the server and will be removed from state.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Resource not found

  with cloudflare_pages_domain.clov3r-cc,
  on my_homepage.tf line 20, in resource "cloudflare_pages_domain" "clov3r-cc":
  20: resource "cloudflare_pages_domain" "clov3r-cc" {

The resource was not found on the server and will be removed from state.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":66,"Program":"tfcmt","SHA1":"d30fb5037a643a23f7c53987da07523ad48cdd11","Vars":{},"WorkflowName":"Terraform CI"} -->